// Keyboard HID (handsfree) panel
"MSG_TYPE_PASSKEY" = "请键入以下口令，然后按下键盘上的 Return 键。";

"MSG_PAIRING_TIMEOUT" = "无法与“%@”配对。请点按“配对”再试一次。";
"MSG_PAIRING_TIMEOUT_AUTO" = "无法与“%@”配对。请在 5 秒钟后尝试与下一个键盘配对。";
"MSG_PAIRING_TIMEOUT_AUTO_LAST" = "无法与“%@”配对。请在 5 秒钟后再试一次。";

"MSG_PAIRING_FAILED" = "无法与您的键盘配对。请点按“配对”再试一次。";
"MSG_PAIRING_FAILED_AUTO" = "无法与您的键盘配对。正在重试…";

// Discovery Panel (General)
"kDiscovery_Gen_ErrorOccurredSearchingKey" = "搜索您的无线设备时出错。";


//getPairingWithDeviceTitle;
"TITLE_PAIRING_WITH_YOUR_KEYBOARD" = "正在与键盘“%@”配对。";
"TITLE_PAIRING_WITH_YOUR_MOUSE" = "正在与鼠标“%@”配对。";

//getSearchingForDeviceTitle;
"TITLE_SEARCHING_FOR_YOUR_KEYBOARD" = "正在搜索您的键盘…";
"TITLE_SEARCHING_FOR_YOUR_MOUSE" = "正在搜索您的鼠标…";

//getDevicePairedTitle
"TITLE_PAIRED_KEYBOARD" = "您的电脑已经与“%@”成功配对。";
"TITLE_PAIRED_MOUSE" = "您的电脑已经与“%@”成功配对";

//getNFoundTitle
"TITLE_KEYBOARD_N_FOUND" = "“设置助理”已找到 %d 个无线键盘。";
"TITLE_MOUSE_N_FOUND" = "“设置助理”已找到 %d 个无线鼠标设备。";

//getFoundTitle
"TITLE_KEYBOARD_FOUND" = "“设置助理”已找到名称为“%@”的键盘。";
"TITLE_MOUSE_FOUND" = "“设置助理”已找到名称为“%@”的鼠标。";

//getMessageStartPairing
"MSG_START_PAIRING_KEYBOARD" = "从列表中选取键盘，然后点按“配对”。键盘配对后，会出现一个密码，您需要用键盘输入此密码。";
"MSG_START_PAIRING_MOUSE" = "“设置助理”正在尝试与列表中的各个鼠标配对。配对好鼠标后，您可以使用鼠标移动指针。";

//getMessageStartPairingSingle
"MSG_START_PAIRING_KEYBOARD_SINGLE" = "与“%@”的配对将自动开始。键盘配对后，将出现一个密码，您需要用键盘输入此密码。";
"MSG_START_PAIRING_MOUSE_SINGLE" = "与“%@”的配对将自动开始。鼠标配对后，您可以使用鼠标来移动指针。";

//getMessageDeviceNotFound
"MSG_KEYBOARDS_NOT_FOUND_SO_FAR" = "找不到键盘。正在搜索…";
"MSG_MOUSE_NOT_FOUND_SO_FAR" = "找不到鼠标。正在搜索…";

//getMessageNoDevice
"MSG_NO_KEYBOARD" = "您的电脑尚未连接任何键盘。现在，请连接您的键盘。";
"MSG_NO_MOUSE" = "您的电脑尚未连接任何鼠标。现在，请连接您的鼠标。";

//getMessageNoDeviceBT
"MSG_NO_KEYBOARD_BLUETOOTH"	= "您的电脑尚未连接任何键盘。现在，请连接您的键盘。\n\n如果您使用的是 Apple Wireless Keyboard 键盘，请确定电池安装正确且键盘电源已打开。";
"MSG_NO_MOUSE_BLUETOOTH" = "您的电脑尚未连接任何鼠标。现在请连接您的鼠标。\n\n如果您使用的是 Apple Wireless Mouse 鼠标，请打开键盘底部的开关（滑动此开关以显露 LED）。\n\n如果您不使用鼠标，现在请连接键盘。";

//getMessageGettingDeviceName
"MSG_GETTING_KEYBOARD_NAMES" = "正在更新 %d 个键盘名称…";
"MSG_GETTING_MOUSE_NAMES" = "正在更新 %d 个鼠标名称…";

//getMessageWaitingForAcknowlegement
"MSG_WAITING_FOR_KEYBOARD_ACKNOWLEGEMENT" = "要认可配对，请按下键盘上的 Return 键。否则，%d 秒钟后将重新开始配对。";
"MSG_WAITING_FOR_MOUSE_ACKNOWLEGEMENT" = "要认可配对，请使用鼠标点按下方的“好”按钮。否则，%d 秒钟后将重新开始配对。";

//getMessageAuthenticationFailure
"MSG_AUTH_FAILURE_KEYBOARD" = "您输入的口令不正确。请点按“配对”再试一次。";
"MSG_AUTH_FAILURE_MOUSE" = "与您的鼠标配对未成功。请点按“配对”再试一次。";

//getMessageAuthenticationFailureAuto
"MSG_AUTH_FAILURE_KEYBOARD_AUTO" = "您输入的口令不正确。请在 5 秒钟后再次与您的键盘配对。";
"MSG_AUTH_FAILURE_MOUSE_AUTO" = "与您的鼠标配对未成功。5 秒钟后会再次与您的鼠标配对。";

//getMessageAlreadyPaired
"MSG_ALREADY_PAIRED_KEYBOARD" = "正在等待键盘连接…";
"MSG_ALREADY_PAIRED_MOUSE" = "点按鼠标以开始使用。";

// ** WARNINGS **
//getWarningPairingSingle
"MSG_WARNING_PAIRING_MOUSE_SINGLE" = "如果这不是您的鼠标，请确定您的鼠标的电源已打开，然后等待搜索重新开始。";
"MSG_WARNING_PAIRING_KEYBOARD_SINGLE" = "如果这不是您的键盘，请确定您的键盘的电源已打开，然后等待搜索重新开始。";

//getWarningPairing 
"MSG_WARNING_PAIRING_MOUSE" = "如果您的鼠标不在列表中，请确定鼠标电源已打开，然后等待搜索重新开始。";
"MSG_WARNING_PAIRING_KEYBOARD" = "如果您的键盘不在列表中，请确定键盘电源已打开，然后点按“取消”以重新开始搜索。";

//getWarningAcknowlegement
"MSG_WARNING_ACK_MOUSE" = "如果鼠标移动时指针不移动，那么您的鼠标并未与您的电脑配对。请等待配对重新开始。";
"MSG_WARNING_ACK_KEYBOARD" = "如果按下键盘上的 Return 键后，配对不被认可，则表明键盘并未与电脑配对。请稍候，等待配对重新开始。";

// ** PAIRING STATUS **
//getMessagePairingStarting
"MSG_PAIRING_STARTING" = "正与您的设备配对…";

//getMessagePairingConnectingToDevice
"MSG_PAIRING_CONNECTING" = "正在连接…";

//getMessagePairingConnectionEstablished
"MSG_PAIRING_CONNECTION_ESTABLISHED" = "已连接。";

//getMessagePairingConnectionComplete
"MSG_PAIRING_COMPLETE" = "配对完成。";

"CUSTOM_MOUSE_NAME"	= "“%@”的鼠标";
"CUSTOM_KEYBOARD_NAME"	= "“%@”的键盘";

